---
kind: method
id: M:Autodesk.Revit.DB.CitySet.Erase(Autodesk.Revit.DB.City)
source: html/636b8acc-93fe-0b99-d38e-627915a3be53.htm
---
# Autodesk.Revit.DB.CitySet.Erase Method

Removes a specified city from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	City item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.City`) - The city to be erased.

## Returns
The number of cities that were erased from the set.